In [1]:
import numpy as np
import pandas as pd

In [2]:
ps = pd.Series(range(5),index = ['a','s','d','f','g'])
ps

a    0
s    1
d    2
f    3
g    4
dtype: int64

In [3]:
pd1 = pd.DataFrame(np.arange(9).reshape(3,3),index = ['a','a','d'])  #索引可以相同
pd1

   0  1  2
a  0  1  2
a  3  4  5
d  6  7  8

# 改

In [5]:
#更改series
ps['d'] = 66
ps
ps[2] = 55
ps

a     0
s     1
d    55
f     3
g     4
dtype: int64

In [9]:
#更改dataframe列数据
pd1[1] = 999
pd1
pd1[1] = [9,10,11]
pd1

   0   1  2
a  0   9  2
a  3  10  5
d  6  11  8

In [19]:
#更改dataframe行数据
pd1.loc['a'] = 3    #只能更改一整行
pd1
pd1.loc['a','A'] = 1111  #对指定行和列的单个数据进行更改
pd1

   0   1  2       A
a  3   3  3  1111.0
a  3   3  3  1111.0
d  6  11  8     NaN

# 查

In [30]:
#serise行索引查
ps[2]
ps['d']
#series位置切片索引
ps[0:4]
#series标签切片索引
ps['a':'f']
#series不连续索引
ps[['a','f']]
ps[[0,3,1]]
#series布尔索引
ps[ps>3]

d    55
g     4
dtype: int64

In [32]:
#dataframe列索引
pd1

   0   1  2       A
a  3   3  3  1111.0
a  3   3  3  1111.0
d  6  11  8     NaN

In [41]:
#dataframe列索引
pd1['A']
#dataframe列索引取多列
pd1[['A',2]]
#dataframe选取一个值
pd1[2][0]
#dataframe行切片
pd1[1:3]

   0  1  2       A
a  3  3  3  1111.0